BaseConfiguration/Money_2_0/InformationRegisters/НастройкиТранспортаОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>COMАутентификацияОперационнойСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMВариантРаботыИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяИнформационнойБазыНаСервере1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяСервера1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMКаталогИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILМаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILУчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEКаталогОбменаИнформацией</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеМаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПуть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSURLВебСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSЗапомнитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>165</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSИспользоватьПередачуБольшогоОбъемаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТранспортаСообщенийОбменаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыПодключенияВнешнейСистемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспондент</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ЗначенияНастроекИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Только для хранения "сложных типов" и строк длиннее 250-и символов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОперацииШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/AccumulationRegisters/ОборотыПлановыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПлановыхОпераций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазделБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатьяБюджета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьГрафаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьШаблонОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ПоказателиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПоказателиБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Comment>Каелндарное начало периода, рассматриваемого в бюджете.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатьяБюджета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonModules/ОбновлениеИнформационнойБазыДеньги/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбновлениеИнформационнойБазыДеньги: Обновление информационной базы "1С:Деньги"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = Метаданные.Имя;
	Описание.Версия = Метаданные.Версия;
	Описание.ИдентификаторИнтернетПоддержки = "Money";
	
	// Требуемые библиотеки
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	Описание.ТребуемыеПодсистемы.Добавить("ИнтернетПоддержкаПользователей");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса") Тогда
		Описание.ТребуемыеПодсистемы.Добавить("БиблиотекаТехнологииСервиса");
	КонецЕсли;
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
//
//	ПРИМЕРЫ:
//
//	// Обработчики, выполняемые при каждом обновлении ИБ
//	Обработчик = Обработчики.Добавить();
//	Обработчик.Версия = "*";
//	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбязательныйОбработчик";
//	Обработчик.РежимВыполнения = "Монопольно";
//	
//	// Обработчики, выполняемые при заполнении пустой ИБ
//	Обработчик = Обработчики.Добавить();
//	Обработчик.НачальноеЗаполнение = Истина;
//	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ПервыйЗапуск";
//	
//	// Обработчики, выполняемые при заполнении пустой ИБ и при переходе на новую версию.
//	Обработчик = Обработчики.Добавить();
//	Обработчик.Версия = "1.0.2.2";
//	Обработчик.НачальноеЗаполнение = Истина;
//	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ИнициализироватьРолиИсполнителей";
//
//	// Обработчики, выполняемые при переходе на новую версию.
//	Обработчик = Обработчики.Добавить();
//	Обработчик.Версия = "2.0.1.5";
//	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбновитьДополнительныеОбработки_2_0_1_5";
//	
//	// Обработчики отложенного обновления
//	Обработчик = Обработчики.Добавить();
//	Обработчик.Версия = "2.1.4.11";
//	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ТестированиеОтложенногоОбновления";
//	Обработчик.РежимВыполнения = "Отложенно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// Обработчики, выполняемые при каждом обновлении ИБ
	
	// Пример объявления обработчика:
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "*";
	//Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбязательныйОбработчик";
	//Обработчик.РежимВыполнения = "Монопольно";
	
	
	// Обработчики, выполняемые при заполнении пустой ИБ
	#Область Заполнение_пустой_ИБ
		
	// Заполняем неразделенные справочники и реквизиты предопределенных элементов неразделенных справочников
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.ЗаполнитьПустуюИБВНеразделенномРежиме";
	Обработчик.Версия = "1.0.0.1";
	Обработчик.ОбщиеДанные = Истина;
	
	
	// Начальное заполнение разделенных данных
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.0.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.ЗаполнитьПустуюИБ";
	
	#КонецОбласти 
	
	
	////////////////////////////////////////////////////////////////////////////////
	// Обработчики, выполняемые при заполнении пустой ИБ и при переходе на новую версию
	
	// Пример объявления обработчика:
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "1.0.2.2";
	//Обработчик.НачальноеЗаполнение = Истина;
	//Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ИнициализироватьРолиИсполнителей";
	
	
	////////////////////////////////////////////////////////////////////////////////
	// Обработчики, выполняемые при переходе на новую версию
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.34.33";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203433";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.36.01";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203601";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.36.20";
	Обработчик.ОбщиеДанные = Истина; // Обработка в НЕразделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203620_Общие";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.1";
	Обработчик.ОбщиеДанные = Истина; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203901_Общие";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.1";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203901";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.33";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203933";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.37";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203937";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.49";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203949";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.53";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203953";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.57";
	Обработчик.ОбщиеДанные = Истина; // Обработка в НЕразделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203957";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.39.69";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_203969";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.40.25";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204025";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.41.17";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204117";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.42.07";
	Обработчик.ОбщиеДанные = Истина; // Обработка в НЕразделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204207_Общие";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.42.07";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204207";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.43.15";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204315";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.43.31";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204331";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.44.19";
	Обработчик.ОбщиеДанные = Ложь; // Обработка в разделенном режиме
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.Обновление_204419";
	
	////////////////////////////////////////////////////////////////////////////////
	// Обработчики отложенного обновления
	
	////////////////////////////////////////////////////////////////////////////////
	// Обработчики, выполняемые при каждом обновлении ИБ
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыДеньги.ВыполнятьПриКаждомОбновлении";
	Обработчик.РежимВыполнения = "Монопольно";
	
КонецПроцедуры

// Обработчик, вызываемый из ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек()
//
Процедура ПриОпределенииНастроек(Параметры) Экспорт
	
	// Пример:
	//Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ГрафыБюджета);
	
	// в текущей версии не используется
	Возврат;

КонецПроцедуры

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	// в текущей версии не используется
	Возврат;
КонецПроцедуры

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
		
	Если ОбщегоНазначения.РазделениеВключено() 
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьГраницыИтогов();
	Справочники.ФинансовыеЦели.ОбновитьУпорядочивание();
	ОбновитьСлужебныеЗаписиСправочников();
	
КонецПроцедуры

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Макет) Экспорт
	// в текущей версии не используется
	Возврат;
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	// в текущей версии не используется
	Возврат;
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Заполнение ИБ при первом запуске

#Область ЗаполнитьПустуюИБ

// Начальное заполнение пустой базы неразделяемыми данными
//	Выполняется в первую очередь при любом режиме работы
Процедура ЗаполнитьПустуюИБВНеразделенномРежиме(Параметр = Неопределено) Экспорт
	
	Справочники.ГрафыБюджета.ПриНачальномЗаполненииЭлементов();
	ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций();
	Справочники.ВидыВычетовНДФЛ.НачальноеЗаполнение();
	Справочники.ВидыДоходовНДФЛ.НачальноеЗаполнение();
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
		Возврат;
	КонецЕсли;
	МодульОбновленияВНеразделенномРежиме = ОбщегоНазначения.ОбщийМодуль("ОСДОбновлениеИнформационнойБазы");
	Если МодульОбновленияВНеразделенномРежиме <> Неопределено Тогда
		МодульОбновленияВНеразделенномРежиме.ЗаполнитьПустуюИБ();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПустуюИБ(Параметр = Неопределено) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы();
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	Константы.ИспользоватьФинансовыеЦели.Установить(Истина);
	
	Справочники.Валюты.ПриНачальномЗаполненииЭлементов();
	Справочники.Контакты.ПриНачальномЗаполненииЭлементов();
	Справочники.СтатьиДоходов.ПриНачальномЗаполненииЭлементов();
	Справочники.СтатьиРасходов.ПриНачальномЗаполненииЭлементов();
	Справочники.ФинансовыеЦели.ПриНачальномЗаполненииЭлементов();
	Справочники.КартинкиПриложения.ПроверитьНачальноеЗаполнение();
	ПланыВидовХарактеристик.ВидыАналитик.ПриНачальномЗаполненииЭлементов();
	
	Константы.ВалютаИндикаторовРабочегоСтола.Установить(Константы.ВалютаУчета.Получить());
	Константы.ОсновнойВариантБюджета.Установить(Справочники.ВариантыБюджетов.БазовыйВариант);
	
	ПланыСчетов.РазделыУчета.ПриНачальномЗаполненииЭлементов();
	ПланыВидовХарактеристик.ВидыСубконто.ПриНачальномЗаполненииЭлементов();
	
	Справочники.ВариантыБюджетов.ПриНачальномЗаполненииЭлементов();
	ДеньгиВызовСервера.ПроверитьПределПланирования();
	
	ОбновитьСлужебныеЗаписиСправочников();
	
	СоздатьНастройкиТранспортовОбмена();
	
	ОбновитьПодсистемуСвойств();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ДеньгиВОблаке") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДеньгиВОблаке");
		Модуль.ЗаполнитьПустуюИБ();
	КонецЕсли;
	
КонецПроцедуры

// Создает настройки транспортов обмена данными 
//
Процедура СоздатьНастройкиТранспортовОбмена() 
	
	УзелСервера = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	
	// Обновление настроек WS-соединения с узлом плана обмена
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Корреспондент", УзелСервера);
	СтруктураЗаписи.Вставить("WSURLВебСервиса", "");
	СтруктураЗаписи.Вставить("WSЗапомнитьПароль", Истина);
	СтруктураЗаписи.Вставить("WSИмяПользователя", "");
	СтруктураЗаписи.Вставить("WSПароль", "");
	СтруктураЗаписи.Вставить("ВидТранспортаСообщенийОбменаПоУмолчанию", Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	СтруктураЗаписи.Вставить("FILEКаталогОбменаИнформацией", КаталогВременныхФайлов());
	
	РегистрыСведений.НастройкиТранспортаОбменаДанными.ОбновитьЗапись(СтруктураЗаписи);
	
	// проверка этого узла для синхронизации с мобильными приложениями
	УзелМобильных = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("МобильноеПриложение");
	ДеньгиОбменСЦентральнойБазой.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(Ложь);
	
КонецПроцедуры

Процедура ОбновитьПодсистемуСвойств() Экспорт
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Долги");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Имущество");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Контакты");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_КошелькиИСчета");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_СтатьиДоходов");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_СтатьиРасходов");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Доход");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_МыВернулиДолг");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_МыВзялиВДолг");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_МыДалиВДолг");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_НамВернулиДолг");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ОбменВалюты");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Перемещение");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Расход");
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_УниверсальнаяОперация");
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций() Экспорт
	
	Константы.ИсточникДанныхАдресногоКлассификатора.Установить("Сервис1С");
	
	Если ОбщегоНазначения.РазделениеВключено() 
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверкиАдреса = Новый Структура;
	ПараметрыПроверкиАдреса.Вставить("АдресТолькоРоссийский", Истина);
	ПараметрыПроверкиАдреса.Вставить("ПроверятьКорректность", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ЗапрещатьВводНекорректного", Ложь);
	ПараметрыПроверкиАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыАдреса.Вставить("МожноИзменятьСпособРедактирования",    Истина);
	ПараметрыАдреса.Вставить("РедактированиеТолькоВДиалоге",         Ложь);
	ПараметрыАдреса.Вставить("ОбязательноеЗаполнение",               Ложь);
	ПараметрыАдреса.Вставить("РазрешитьВводНесколькихЗначений",      Ложь);
	ПараметрыАдреса.Вставить("ЗапретитьРедактированиеПользователем", Ложь);
	ПараметрыАдреса.Вставить("Используется",                         Истина);
	ПараметрыАдреса.Вставить("НастройкиПроверки",                    ПараметрыПроверкиАдреса);
	ПараметрыАдреса.Вставить("ХранитьИсториюИзменений",              Ложь);
	ПараметрыАдреса.Вставить("МеждународныйФорматАдреса",            Ложь);
	ПараметрыАдреса.Вставить("Наименование",                         "");
	ПараметрыАдреса.Вставить("Имя",                                  "");
	ПараметрыАдреса.Вставить("ВидРедактирования",                    "Диалог");
	ПараметрыАдреса.Вставить("ИсправлятьУстаревшиеАдреса",           Ложь);
	
	ПараметрыАдреса.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ПараметрыАдреса.Вставить("Порядок", 1);
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Юридический адрес организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	ПараметрыАдреса.Порядок  = 2;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Фактический адрес организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
	ПараметрыАдреса.Порядок  = 6;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Почтовый адрес организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.НастройкиПроверки = Неопределено;
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
	ПараметрыАдреса.Тип      = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ПараметрыАдреса.Порядок  = 3;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Телефон организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
	ПараметрыАдреса.Тип      = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПараметрыАдреса.Порядок  = 4;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Факс организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
	ПараметрыАдреса.Тип      = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ПараметрыАдреса.Порядок  = 5;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Адрес электронной почты организации'"));
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
	ПараметрыАдреса.Вид      = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации;
	ПараметрыАдреса.Тип      = Перечисления.ТипыКонтактнойИнформации.Другое;
	ПараметрыАдреса.Порядок  = 5;
	ПараметрыАдреса.Вставить("Подсказка", НСтр("ru='Любая другая контактная информация'"));
	ПараметрыАдреса.Вставить("ВидПоляДругое",     "ОднострочноеШирокое");
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыАдреса);
	
КонецПроцедуры


#КонецОбласти


#Область ВыполнятьПриКаждомОбновлении

Процедура ВыполнятьПриКаждомОбновлении(Параметр = Неопределено) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеПредопределенных();
	
КонецПроцедуры

Процедура ПроверитьНаличиеПредопределенных(БылиОшибки = Ложь) Экспорт
	
	ТекстОшибки = "";
	Если ОбслуживаниеСправочников.ПредопределенныеЭлементыТребуютПроверки() Тогда
		ОбслуживаниеСправочников.ПроверитьПредопределенныеЭлементы(ТекстОшибки);
		БылиОшибки = Не ПустаяСтрока(ТекстОшибки);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги",
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбновлениеНа_2_0_34

Процедура Обновление_203433() Экспорт
	
	// Обновление способа и функциональных опций синхронизации
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	Если РазделениеВключено Тогда
		Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
			Возврат;
		Иначе
			Способ = Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом;
		КонецЕсли;
	Иначе
		Способ = ?(Константы.ИспользоватьСинхронизациюДанных.Получить(), 
				Перечисления.СпособыСинхронизацииДанных.ОбменФайлами, 
				Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	КонецЕсли;
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Способ);
	
КонецПроцедуры

#КонецОбласти


#Область ОбновлениеНа_2_0_36

Процедура Обновление_203601() Экспорт
	
	ОбновитьНастройкиТранспортаWS();
	ОбновитьПодсистемуСвойств();
	ПроверитьФорматОбменаМобильныхУстройств();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ДеньгиВОблаке") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДеньгиВОблаке");
		Модуль.ЗаполнитьНастройкиИнтеграцииПоУмолчанию();
		Модуль.ПроверитьСценарииАвтономногоКлиента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФорматОбменаМобильныхУстройств()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МобильноеПриложение.Ссылка КАК Ссылка,
		|	МобильноеПриложение.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
		|	МобильноеПриложение.ВерсияОбмена КАК ВерсияОбмена
		|ИЗ
		|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
		|ГДЕ
		|	Не МобильноеПриложение.ЭтотУзел
		|	И МобильноеПриложение.ВерсияФорматаОбмена = """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		УзелОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		УзелОбъект.ВерсияФорматаОбмена = "1.6.3";
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

Процедура ОбновитьНастройкиТранспортаWS() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиТранспортаОбменаДанными.*
	|ИЗ
	|	РегистрСведений.НастройкиТранспортаОбменаДанными КАК НастройкиТранспортаОбменаДанными
	|ГДЕ
	|	ВЫРАЗИТЬ(НастройкиТранспортаОбменаДанными.WSURLВебСервиса КАК СТРОКА(100)) <> """"
	|	И Не НастройкиТранспортаОбменаДанными.WSИспользоватьПередачуБольшогоОбъемаДанных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.НастройкиТранспортаОбменаДанными.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.WSИспользоватьПередачуБольшогоОбъемаДанных = Истина;
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Обновление_203620_Общие() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбновленияВНеразделенномРежиме = ОбщегоНазначения.ОбщийМодуль("ОСДОбновлениеИнформационнойБазы");
	Если МодульОбновленияВНеразделенномРежиме <> Неопределено Тогда
		МодульОбновленияВНеразделенномРежиме.Обновление_203620();
	КонецЕсли;
	
КонецПроцедуры


Процедура Обновление_203901_Общие() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() 
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ВидыВычетовНДФЛ.НачальноеЗаполнение();
	Справочники.ВидыДоходовНДФЛ.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура Обновление_203901() Экспорт
	
	ОбновитьРеквизитыПлательщиковНДФЛ();
	
КонецПроцедуры

Процедура ОбновитьРеквизитыПлательщиковНДФЛ()
	
	Выборка = Справочники.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.ПолучитьОбъект();
		
		РазложитьФИОПлательщика(СпрОбъект);
		СпрОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		
		Если Не ЗначениеЗаполнено(СпрОбъект.СтранаПостоянногоМестонахождения) Тогда
			СпрОбъект.СтранаПостоянногоМестонахождения = Справочники.СтраныМира.Россия;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СпрОбъект.КатегорияПлательщикаНДФЛ) Тогда
			СпрОбъект.КатегорияПлательщикаНДФЛ = Перечисления.КатегорииНалогоплательщикаНДФЛ.НеПредприниматель;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СпрОбъект.ПолФизическогоЛица) Тогда
			СпрОбъект.ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Мужской;
		КонецЕсли;
		
		ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СпрОбъект, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазложитьФИОПлательщика(Плательщик)
	
	ФИО = СтрРазделить(Плательщик.Наименование, " ");
	Плательщик.ФамилияИП = ?(ФИО.Количество() > 0, ФИО[0], "");
	Плательщик.ИмяИП = ?(ФИО.Количество() > 1, ФИО[1], "");
	Плательщик.ОтчествоИП = ?(ФИО.Количество() > 2, ФИО[2], "");
	Плательщик.НаименованиеПолное = СокрЛП(Плательщик.ФамилияИП + " " + Плательщик.ИмяИП + " " + Плательщик.ОтчествоИП);
	Плательщик.НаименованиеСокращенное = СокрЛП(Плательщик.ФамилияИП) + " " 
				+ ?(ЗначениеЗаполнено(Плательщик.ИмяИП), Врег(Лев(СокрЛ(Плательщик.ИмяИП), 1)) + ".","")
				+ ?(ЗначениеЗаполнено(Плательщик.ОтчествоИП), Врег(Лев(СокрЛ(Плательщик.ОтчествоИП), 1)) + ".","");
	
КонецПроцедуры


Процедура Обновление_203933() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаполнитьЗначениямиПоУмолчанию();
	ИсправитьТипыКонтактнойИнформации();
	ПроверитьОперацииШаблонов();
	
КонецПроцедуры

Процедура ПроверитьОперацииШаблонов()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацииШаблонов.Шаблон,
	|	ОперацииШаблонов.Операция,
	|	ОперацииШаблонов.ПлановаяДата,
	|	ОперацииШаблонов.Операция.Дата КАК ОперацияДата
	|ИЗ
	|	РегистрСведений.ОперацииШаблонов КАК ОперацииШаблонов
	|ГДЕ
	|	ОперацииШаблонов.ПлановаяДата = &ПустаяДата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			Запись = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Если ЗначениеЗаполнено(Выборка.ОперацияДата) Тогда
				Запись.ПлановаяДата = Выборка.ОперацияДата;
				Запись.Записать();
			Иначе
				Запись.Удалить();
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Ошибка, 
					Метаданные.РегистрыСведений.ОперацииШаблонов, ,
					"Не удалось обновить запись РС ОперацииШаблонов для """ + Выборка.Шаблон + """, """ + Выборка.Операция + """:
					|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	СписокУзлов = Неопределено;
	СоставПлана = Неопределено;
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Или Режим = "Разделенный" Тогда
		СписокУзлов = СинхронизацияАвтономныхКопий.ВсеУзлыПланаОбмена("СинхронизацияАвтономныхКопий");
		СоставПлана = Метаданные.ПланыОбмена.СинхронизацияАвтономныхКопий.Состав;
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		СписокУзлов = СинхронизацияАвтономныхКопий.ВсеУзлыПланаОбмена("МобильноеПриложение");
		СоставПлана = Метаданные.ПланыОбмена.МобильноеПриложение.Состав;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СписокУзлов) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СинхронизацияАвтономныхКопий.ЗарегистрироватьОбъектМетаданныхКОптправкеНаУзлы(
				Метаданные.РегистрыСведений.ОперацииШаблонов, СписокУзлов, СоставПлана);
	Исключение
		ЗаписьЖурналаРегистрации("Обновление ИБ", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.РегистрыСведений.ОперацииШаблонов, ,
				"Не удалось зарегистрировать регистр сведений для обмена с автономными копиями: 
				|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ИсправитьТипыКонтактнойИнформации()
	
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	НЕ ВидыКонтактнойИнформации.ЭтоГруппа
	|	И ВидыКонтактнойИнформации.Тип.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаменитьТипКИ(Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьТипКИ(Выборка)
	
	ОбъектВидаКИ = Выборка.Ссылка.ПолучитьОбъект();
	Если СтрНайти(Нрег(ОбъектВидаКИ.Наименование), "адрес") > 0  Тогда
		ОбъектВидаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ИначеЕсли СтрНайти(Нрег(ОбъектВидаКИ.Наименование), "телефон") > 0 Тогда
		ОбъектВидаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ИначеЕсли СтрНайти(Нрег(ОбъектВидаКИ.Наименование), "факс") > 0 Тогда
		ОбъектВидаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
	ИначеЕсли СтрНайти(Нрег(ОбъектВидаКИ.Наименование), "электронная почта") > 0 Тогда
		ОбъектВидаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Иначе
		ОбъектВидаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	КонецЕсли;
	
	ОбъектВидаКИ.ОбменДанными.Загрузка = истина;
	
	Попытка
		ОбъектВидаКИ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Обновление ИБ", УровеньЖурналаРегистрации.Ошибка, 
				Неопределено, ,
				"Не удалось обновить тип контактной информации для """ + Выборка.Ссылка + """:
				|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьПланыОбменаСМобильнымиУстройствами()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	План.Ссылка
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК План
	|ГДЕ
	|	НЕ План.ЭтотУзел
	|	И НЕ План.МобильноеУстройство";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УзелОбъект.МобильноеУстройство = Истина;
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура Обновление_203937() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Или Режим = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;

	Приостановить = Ложь;	
	Если Режим = "КлиентОблака" Тогда
		РегЗадание = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена(Истина);
		Если РегЗадание = Неопределено Тогда
			Приостановить = Истина;
		Иначе
			Приостановить = Не РегЗадание.Использование;
		КонецЕсли;
	Иначе
		Приостановить = Истина;
	КонецЕсли;
	
	Константы.ДеньгиПриостановитьАвтосинхронизацию.Установить(Приостановить);
	
	ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
		"Завершено обновление на версию 2.0.39.41");
		
КонецПроцедуры

Процедура Обновление_203949() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	БылиОшибки = Ложь;
	ПроверитьНаличиеПредопределенных(БылиОшибки);
	Если Режим <> "Разделенный" И Режим <> "КлиентОблака" Тогда
		ПроверитьПланыОбменаСМобильнымиУстройствами();
	КонецЕсли;

	РегистрыНакопления.ОборотыПлановыхОпераций.ПроверитьЗаписиРегистра(БылиОшибки);
	РегистрыСведений.Расписания.ПроверитьЗаписиРегистра(БылиОшибки);
	РегистрыСведений.Расписания.ПерезаписатьШаблоны();
	РегистрыСведений.ПоказателиБюджета.ПроверитьЗаписи();
	АналитикаСтатей.ПроверитьОбновитьИспользованиеАналитики();
	АналитикаСтатей.ПроверитьПакетыДополнительнойАналитики();
	
	ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
		"Завершено обновление на версию 2.0.39.49"
			+ ?(БылиОшибки, ". Ошибки обновления зарегистрированы в журнале", " без ошибок"));
	
КонецПроцедуры

Процедура Обновление_203953() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	БылиОшибки = Ложь;
	ОбслуживаниеСправочников.ПроверитьЭлементыСправочников(БылиОшибки);
	ПлановыеОперации.ПроверитьЗаписиРегистровПлановыхОпераций(БылиОшибки);
	РегистрыСведений.ДатыРасписаний.ПроверитьОперацииПоДатамРасписания(БылиОшибки);
	ПлановыеОперации.ЗарегистрироватьПлановыеОперацииВОбмене();
	БюджетированиеСервер.ЗарегистрироватьВариантыБюджетовВОбмене();
	
	ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
		"Завершено обновление на версию 2.0.39.53" 
			+ ?(БылиОшибки, ". Ошибки обновления зарегистрированы в журнале", " без ошибок"));
	
КонецПроцедуры

Процедура Обновление_203957() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Неразделенный" Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданий") Тогда
		МодульОчередиЗаданий = ОбщегоНазначения.ОбщийМодуль("ОчередьЗаданийСлужебныйРазделениеДанных");
		МодульОчередиЗаданий.ОбновитьЗаданияОчередиПоШаблонам();	
		ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
			"Завершено обновление на версию 2.0.39.57 (общие данные)");
	КонецЕсли;
	
КонецПроцедуры

Процедура Обновление_203969() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	БылиОшибки = Ложь;
	ПроверитьНаличиеПредопределенных(БылиОшибки);
	ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
		"Завершено обновление на версию 2.0.39.69"
			+ ?(БылиОшибки, ". Ошибки обновления зарегистрированы в журнале", " без ошибок"));
	
КонецПроцедуры

Процедура Обновление_204025() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Разделенный" И Режим <> "Неразделенный" Тогда
		ЗаданиеОбмена = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена(Истина);
		Если ЗаданиеОбмена <> Неопределено Тогда
			РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(ЗаданиеОбмена, 
					ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОблако") 
						И Не Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить());
		КонецЕсли;
		
		ЗаданиеОбмена = АвтоматОбменаФайлами.РегламентноеЗаданиеОбмена();
		Если ЗаданиеОбмена <> Неопределено Тогда
			РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(ЗаданиеОбмена, 
					ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОбменСМобильными") 
						И Не Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить());
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Информация,,,
			"Завершено обновление на версию 2.0.40.25 без ошибок");
	КонецЕсли;
	
КонецПроцедуры

Процедура Обновление_204117() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Разделенный" И Режим <> "Неразделенный" Тогда
		ОбновитьИтогиУниверсальныхОпераций();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьИтогиУниверсальныхОпераций()
	
	Выборка = Документы.УниверсальнаяОперация.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Ошибка, ,
					ДокументОбъект.Ссылка, ПодробноеПредставлениеОшибки(Ошибка));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Обновление_204207_Общие() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() 
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ВидыВычетовНДФЛ.НачальноеЗаполнение();
	Справочники.ВидыДоходовНДФЛ.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура Обновление_204207() Экспорт
	
	ОбновитьРеквизитыПлательщиковНДФЛ();
	
КонецПроцедуры

Процедура Обновление_204315() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Разделенный" И Режим <> "Неразделенный" Тогда
		ПроцессыОбменаСлужебный.ЗаполнитьКонтрольныеСуммыВИБ();
	КонецЕсли;
	
КонецПроцедуры

Процедура Обновление_204331() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Неразделенный" Тогда
		Справочники.Валюты.ПроверитьСсылкиВСправочниках();
	КонецЕсли;
	
КонецПроцедуры

Процедура Обновление_204419() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "Неразделенный" Тогда
		Справочники.КартинкиПриложения.ПроверитьНачальноеЗаполнение();
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти 

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции

#Область ВспомогательныеПроцедурыИФункции

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	// в текущей версии не используется
	Возврат;
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	// в текущей версии не используется
	Возврат;
КонецПроцедуры


#КонецОбласти 


#Область Служебный_функционал_модуля


Процедура ПроверитьГраницыИтогов()

	Если ОбщегоНазначения.РазделениеВключено() 
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если УправлениеИтогамиИАгрегатамиСлужебный.НадоСдвинутьГраницуИтогов() Тогда
		УправлениеИтогамиИАгрегатамиСлужебный.РассчитатьИтоги();
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьСлужебныеЗаписиСправочников() 
	
	БюджетированиеСервер.ОбновитьВсеКлючиСтатейБюджета();
	РегистрыСведений.СтатистикаСправочников.ОбновитьВсюСтатистикуСправочников();
	РегистрыСведений.ОбработанныеЗначенияСправочников.ОбновитьОбработанныеРеквизитыСправочников();
	
КонецПроцедуры
 

#КонецОбласти
